from selenium import webdriver
import unittest

class NewVisitorTest(unittest.TestCase):
    """Тест нового пользовтеля"""

    def setUp(self):
        """Установка"""
        self.browser = webdriver.Firefox()

    def tearDown(self):
        """Демонтаж"""
        self.browser.quit()

    def test_can_start_a_list_and_retrieve_it_later(self):
        """Тест: можно начать списко и получить его позже"""
        # Эдит слышала про крутое новое он-лайн приложение со списком
        # неотложных дел. Она решает оценить его домашнбб страницу.
        self.browser.get('http://localhost:8000/')

        # Она видит, что заголовок и шапка страницы говорят о списках
        # неотложных дел.
        self.assertIn('To-Do', self.browser.title)
        self.fail('Закончить тест.')

        # Ей сражу же предлагается ввести элемент списка

        # Она набирает в текстовом поле "Купить павлиньи перья" (ее хобби-
        # вязание рыболовных мушек)

        # Когда она нажимает enter, страница обновляется, и теперь страница
        # содержит "1. Купить павлиньи перья" в качестве элемента списка.

        # Текстовое поле по прежнему предлагает добавить еще один элемент.
        # Она вводит "Сделать мушку из павлиньих перьев"
        # (Эдит очень методична)

        # Страница снова обновляется, и, теперь, показывает оба элемента ее списка.

        # Эдит интересно, запомнил ли сайт ее список. Далее она видит, что сайт
        # сгенерировал для нее уникальный URL-адрес, об этом выводиться небольшой
        # текст с обьяснениями.

        # Она посещает этот URL-адрес - ее список по прежнему там.

        # Удовлетворенная, она ложиться спать.

if __name__ == "__main":
    unittest.main(warnings='ignore')

